"""
Очень лёгкая задача

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод или input.txt
Вывод - стандартный вывод или output.txt

Сегодня утром жюри решило добавить в вариант олимпиады ещё одну, Очень Лёгкую
Задачу. Ответственный секретарь Оргкомитета напечатал её условие в одном
экземпляре, и теперь ему нужно до начала олимпиады успеть сделать ещё N копий.
В его распоряжении имеются два ксерокса, один из которых копирует лист за х
секунд, а другой – за y. (Разрешается использовать как один ксерокс, так и оба
одновременно. Можно копировать не только с оригинала, но и с копии.) Помогите
ему выяснить, какое минимальное время для этого потребуется.


Формат ввода:
На вход программы поступают три натуральных числа N, x и y, разделённые пробелом
(1 ≤ N ≤ 2 × 10^8, 1 ≤ x, y ≤ 10).


Формат вывода:
Выведите одно число – минимальное время в секундах, необходимое для получения N копий.


Пример 1
input: 4 1 1
output: 3

Пример 2
input: 1 2
output: 4
"""
