"""
Обход

Ограничение времени - 4 секунды
Ограничение памяти - 256Mb
Ввод - стандартный ввод или input.txt
Вывод - стандартный вывод или output.txt

Выведите все элементы полученного дерева в порядке возрастания.


Формат ввода:
Вводится последовательность целых чисел, оканчивающаяся нулём. Сам ноль в
последовательность не входит. По данной последовательности требуется построить
дерево.


Формат вывода:
Выведите ответ на задачу.


Пример
input: 7 3 2 1 9 5 4 6 8 0
output: 1
output: 2
output: 3
output: 4
output: 5
output: 6
output: 7
output: 8
output: 9
"""
