"""
Вывод листьев

Ограничение времени - 4 секунды
Ограничение памяти - 256Mb
Ввод - стандартный ввод или input.txt
Вывод - стандартный вывод или output.txt

Для полученного дерева выведите список всех листьев (вершин, не имеющих
потомков) в порядке возрастания.


Формат ввода:
Вводится последовательность целых чисел, оканчивающаяся нулём. Сам ноль в
последовательность не входит.


Формат вывода:
Выведите ответ на задачу.


Пример
input: 7 3 2 1 9 5 4 6 8 0
output: 1
output: 4
output: 6
output: 8
"""
