"""
Вывод развилок

Ограничение времени - 4 секунды
Ограничение памяти - 256Mb
Ввод - стандартный ввод или input.txt
Вывод - стандартный вывод или output.txt

Для полученного дерева выведите список всех вершин, имеющих по два ребёнка, в
порядке возрастания.


Формат ввода:
Вводится последовательность целых чисел, оканчивающаяся нулём. Сам ноль в
последовательность не входит. Постройте по этой последовательности дерево.


Формат вывода:
Выведите ответ задачи.


Пример
input: 7 3 2 1 9 5 4 6 8 0
output: 3
output: 5
output: 7
"""
