"""
АВЛ-сбалансированность

Ограничение времени - 4 секунды
Ограничение памяти - 256Mb
Ввод - стандартный ввод или input.txt
Вывод - стандартный вывод или output.txt

Дерево называется АВЛ-сбалансированным, если для любой его вершины высота левого
и правого поддерева для этой вершины различаются не более чем на 1.


Формат ввода:
Вводится последовательность целых чисел, оканчивающаяся нулём. Сам ноль в
последовательность не входит. Постройте дерево, соответствующее данной
последовательности.


Формат вывода:
Определите, является ли дерево сбалансированным, выведите слово YES или NO.


Пример
input: 7 3 2 1 9 5 4 6 8 0
output: YES
"""
